<!DOCTYPE html>
<!--[if lt IE 7]>      <html class="no-js lt-ie9 lt-ie8 lt-ie7"> <![endif]-->
<!--[if IE 7]>         <html class="no-js lt-ie9 lt-ie8"> <![endif]-->
<!--[if IE 8]>         <html class="no-js lt-ie9"> <![endif]-->
<!--[if gt IE 8]><!--> <html class="no-js"> <!--<![endif]-->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <title>We Are Sharing</title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="">
    <meta name="author" content="" />
    <meta name="keywords" content="" />
    <meta name="Copyright" content="" />
    <meta property="og:title" content="" />
    <meta property="og:type" content="website" />
    <meta property="og:url" content="" />
    <meta property="og:description" content="" />
    <meta property="og:image" content="" />
    <meta property="og:site_name" content="" />

    <link rel="apple-touch-icon" href="icon/apple-touch-icon.png" /> 
    <link rel="apple-touch-icon" sizes="72x72" href="apple-touch-icon-72x72-precomposed.png" /> 
    <link rel="apple-touch-icon" sizes="114x114" href="apple-touch-icon-114x114-precomposed.png" />
    <link rel="apple-touch-icon" sizes="144x144" href="apple-touch-icon-144x144-precomposed.png" />
    <link rel="icon" href=" " type="image/x-icon">
    <link rel="stylesheet" href="<?PHP echo SITE_URL?>assets/css/normalize.css">
    <link rel="stylesheet" href="<?PHP echo SITE_URL?>assets/css/style.css">

<!--[if lt IE 10]>
<script src="js/vendor/html5shiv.js"></script>
<script src="http://css3-mediaqueries-js.googlecode.com/svn/trunk/css3-mediaqueries.js"></script>
<![endif]-->

<script src="js/vendor/modernizr-2.6.2.min.js"></script>
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js"></script>
<script>window.jQuery || document.write('<script src="js/vendor/jquery-1.9.1.min.js"><\/script>')</script>
<script src="js/vendor/jquery.easing.js"></script>
</head>
<body>
    <div class="innerWrapper" style="padding:20px;">
        <div class="contact">
            <h3>分享東西網站使用者條款與隱私權聲明</h3>
            <div class="info">
              <ul>

                <li>為了尊重個人資料之隱私及保護，您在使用本網站相關服務時，均需詳細閱讀下列各項使用者約款，並遵從下述條款。如果您不能夠同意這些規則，請不要使用相關服務。為保障您使用本網站之網路安全及個人資料，特此訂定此本「使用者條款與隱私權聲明」。請您在使用本網站之前，詳細閱讀本，並確實遵守。若您繼續使用本網站服務，即表示您同意「使用者條款與隱私權聲明」之內容，並同意本公司蒐集、處理及利用您的個人資料。<br><br><b>隱私權聲明</b>
                    <br>網站伺服器會自動記錄使用者所閱讀的網頁、使用者所來自的網域名稱，作為內容與系統改進，及廣告效果評估的依據。此一部分資訊，用來作數據性的統計分析，除供內部參考，並將提供給廣告商，作為廣告效果評估之依據。

                    <br><br>個人資料之類別：當您申請註冊為本網站會員或參與部分活動時，本網站會請您填寫個人資料，如姓名、出生年月日、性別，連絡電話，電子信箱地址等。其目的是要增加對會員的了解，以提供更好的服務。您加入本網站會員後，本網站得利用會員所填寫的電子信箱地址，寄發本網站相關之產品或活動之電子廣告信件。

                    <br><br>不提供個人資料之影響：您可自由選擇是否提供您上述的個人資料，但當您不同意提供時，您將無法享有本網站所提供之特定會員服務。

                    <br><br>同意個人資料之蒐集、處理、利用或國際傳輸：您了解並同意本公司依本「使用者條款與隱私權聲明」及相關法規，蒐集、處理、利用或國際傳輸您所提供的個人資料。

                    <br><br>蒐集之特定目的：本公司所蒐集您的個人資料係用於：<br>
                    (1) 使用者身分判定；<br>
                    (2) 本網站及本網站合作夥伴為聯絡使用者、請款、寄送商品、發票或宣傳資料；<br>
                    (3) 辦理贈品／獎品寄送及稅務等相關用途。受贈人/受獎人並應依中華民國稅法規定，將獎項所得列入受贈人／受獎人年終綜合所得稅申報；<br>
                    (4) 個人資料之交易；<br>
                    (5) 消費者保護與交易準則；<br>
                    (6) 資訊與資料庫管理；<br>
                    (7) 統計調查與分析等目的；<br>
                    (8) 提供相關行銷活動；<br>
                    (9) 商業與技術資訊；<br>
                    (10) 客戶管理；<br>
                    (11) 會員管理；<br>
                    (12) 客戶服務；<br>
                    (13) 行銷；<br>
                    (14) 及其他合於營業登記項目之蒐集、處理、利用或國際傳輸。

                    <br><br>使用者在本網站的互動服務上（例如：討論區或留言板等），可自由填寫電子郵件信箱的地址，以供互動及溝通之用途。這個資訊可能經由網路傳播被其他讀者利用，此類行為非本網站所能控制，若造成讀者困擾，本網站並不對此負責。

                    <br><br>本公司不聲明及保證透過本公司網站展示或散佈的任何建議、意見、陳述或其他資訊之正確性、完整性或可靠性。我們建議您必須確認任何上述資訊之正確性，而且您必須獨自負擔依賴任何上述資訊之風險。

                    <br><br>本公司不會且不能審核所有使用者張貼於本公司網站之內容或資料。上述使用者張貼之內容與資料未必代表本公司之意見，而且本公司對任何上述內容或資料不負任何責任。然而，本公司保留隨時審核、編輯、移動、拒絕張貼、移除或刪除任何依本公司之判斷已違反或將構成違反本合約規定之由使用者張貼之內容或資料之權利（但就此不負任何義務）。本公司亦保留隨時依法令規定或政府命令揭露任何資訊之權利。

                    <br><br>您明瞭在本公司網站間的資訊往返傳輸是無法保密的，而且您的「通訊」可能被其他人閱讀或中途截取。您明瞭當您傳輸「通訊」到本公司時，除非本合約另有規定外，本公司與您之間不發生任何保密、受託、契約上暗示或其他任何權利義務關係。

                    <br><br><b>其他網站使用</b>
                    <br>本網站為服務網友，在部分網頁中可能包含其他合作的外部網站資訊或其網頁連結，使用者可藉由這些連結直接點選至感興趣的網站。這些外部網站也可能會蒐集您的個人資料，但不論其內容或其隱私權政策，皆與本網站無關，請您務必瞭解並審慎決定是否要提供您的個人資料。本網站對任何外部網站的行為，均不負任何擔保或連帶責任。


                    <br><br><b>兒童及青少年保護</b>
                    <br>未滿二十歲之未成年人或其他無完全行為能力的使用者向本網站申請註冊使用服務時，應先請您的家長、法定代理人或監護人閱讀本「使用者約款暨隱私權政策」，並取得家長、法定代理人或監護人的同意，方得使用或繼續使用本網站，若否，請立即停止使用本網站。當您使用或繼續使用本網站時，即表示您的家長（或監護人）已閱讀、瞭解並同意接受本「使用者約款暨隱私權政策」之所有內容及其後修改變更之內容。


                    <br><br><b>自我安全防護</b>
                    <br>如您與他人共用電腦、或使用公用電腦時，瀏覽完本網站後，請登出並關閉瀏覽器視窗，以保護您個人資料的安全。


                    <br><br><b>Cookies</b>
                    <br>為了便利使用者，本網站可能使用cookie技術，以便於提供更適合使用者個人需要的服務 。Cookie是網站伺候器用來和使用者瀏覽器進行溝通的一種技術，它可能在使用者的電腦中儲存某些資訊。

                    <br><br>本網站允許在本網站上擺放廣告或活動的廠商在您的電腦設定並取用 cookies。在此情形下應適用各該廠商自訂的隱私權保護政策。

                    <br><br>Cookies的使用是為了追蹤您在本網站的活動，以利我們進行站台的各種分析、資料蒐集，進而提供您本網站更好的服務。

                    <br><br>如果您不想接受本網站的cookies，可透過網路瀏覽器的選項設定，取消、或限制此項功能。但此舉可能造成您在使用本網站的部份服務時受到限制。


                    <br><br><b>意見公布規則</b>
                    <br>本網站對於使用者在站內公布的言論不負任何法律責任，此言論的責任應由發表人自負，且本網站有權刪除不適當的言論。

                    <br><br>您同意不在本網站公布任何猥褻、破壞名譽、辱罵、騷擾、仇恨等言論，亦不得散布垃圾郵件或未授權廣告、侵入任何人隱私、從事或鼓勵任何犯罪行為。本網站對上述言論保留刪除與否之權利，並有權在不通知會員的情況下拒絕、修改或移除其內容，或為其他適當之處置。

                    <br><br>當您在本網站使用第三者提供的服務時，您同意遵守該第三者所訂定的服務規則。

                    <br><br><b>個人資料蒐集與使用</b>
                    <br>為提供訂購、行銷、客戶管理或其他合於營業登記項目或章程所訂業務需要之目的，本網站將以電郵、傳真、電話、簡訊或其他通知公告方式利用您所提供之資料。利用對象除本網站外，亦可能包括相關服務的協力機構。如您有依個資法第三條或其他需要協助之處，請聯絡我們。相關資料如為非必填項目，不提供亦不影響您的權益。


                    <br><br><b>使用者應遵守之法律義務及承諾</b>
                    <br>當您使用本網站時，應遵守所屬國家或地方之法令之規定及相關網際網路之國際慣例，絕不為任何非法目的或以任何非法方式使用本網站，亦不得利用本網站侵害他人權益及為違法或不當之行為，否則本網站有權立刻終止您使用本網站之權利。前述違法或不當之行為包括但不限於：

                    <br><br>1.刊登、公布或傳送任何誹謗、侮辱、詐欺、猥褻、色情、賭博或其他違反法令、公序良俗之文字、圖片或其他資料於本網站；<br>
                    2.刊登、傳送任何侵害他人智慧財產權（包括但不限於商標、著作、專利權、營業秘密等）、名譽、隱私權或其他權益之資訊；<br>
                    3.違反依法令或契約所應負之保密義務；<br>
                    4.未經授權進入會員服務系統或是與系統有關之網路、冒用他人帳號或偽造寄件人辨識資料而傳送郵件；<br>
                    5.傳輸、散佈電腦病毒或其他足以破壞、干擾電腦系統或資料之程式或資訊；<br>
                    6.從事不法交易行為或張貼虛假不實、引人犯罪之訊息；<br>
                    7.販賣槍砲、刀械、毒品、禁藥、盜版軟體或其他法令所禁止販賣或利用網路銷售之物品；<br>
                    8.提供賭博資訊或其他引誘他人參與賭博的訊息；<br>
                    9.濫發廣告郵件或其他垃圾信件；<br>
                    10.未經同意蒐集他人電子郵件位址及其他個人資料；<br>
                    11.偽造訊息來源或以任何方式干擾傳輸來源之認定；<br>
                    12.干擾或中斷本服務、伺服器或連結本服務之網路，或不遵守連結至本服務之相關需求、程序、政策或規則等；<br>
                    13.追蹤、干擾或為前述目的而蒐集、儲存他人之個人資訊；<br>
                    14.其他本網站有正當理由認為不適當之行為。


                    <br><br><b>廣告</b>
                    <br>廣告商或產品、服務之供應商，於本網站刊登之廣告內容、產品圖片或其他買賣資訊，本網站僅接受委託予以刊登，就其內容不作實質審查或任何修改，因此，就前揭內容之正確性及可信度，本網站不負擔保責任。您對於廣告之正確性與可信度應自行斟酌與判斷。


                    <br><br><b>買賣或其他交易行為</b>
                    <br>本公司、其他廠商或個人可能透過本網站或經由本網站連結之其他網站提供商品買賣、服務或其他交易行為，您若係與本公司以外之廠商或個人進行交易，各該買賣或其他合約均僅存在於您與各該廠商或個人之間。您應要求各該廠商或個人，就其商品、服務或其他交易標的物之權利、品質、內容、運送、保證事項、退換貨與瑕疵擔保責任等，事先加以詳細闡釋與說明。

                    <br><br>您若係與本公司以外之廠商或個人進行交易，您因各該買賣、服務或其他交易行為所產生之爭執，應向各該廠商或個人尋求救濟或解決之道，本網站聲明絕不介入您與該廠商或個人間的任何買賣、服務或其他交易行為，對於您所獲得的商品、服務或其他交易標的物亦不負任何擔保責任。

                    <br><br>再次提醒您，在您使用本網站進行各種交易行為時，可能會使用到本公司的其他合作廠商或業務夥伴所提供的服務（如金流、物流服務等），在此情形下，您應仔細閱讀並遵守各該廠商或業務夥伴所提供之使用者條款及/或隱私權條款，以保障您的權益。

                    <br><br><b>提醒您，如果您無法遵守本「使用者條款與隱私權聲明」，請勿使用本網站之服務，若您持續使用，便表示您同意本「使用者條款與隱私權聲明」，謝謝您的合作。</b></li>
                </ul>
            </div>
        </div>
        <div class="clear"></div>
    </div>
    <!-- end profile form -->
</body>
</html>