<div class="main-wrapper">
  <!-- 側邊形象圖-->
  <div style="background-image: url('http://lorempixel.com/1250/1560/fashion/')" class="side-image"></div>
  <div class="container">
    <!-- 隱私權聲明-->
    <div class="privacy__content">
      <h1>隱私權聲明</h1>
      <div class="paragraph">
        <p>為了尊重個人隱私保護，東西全球文創產業有限公司謹以下列聲明，向所有使用者說明「wepeople.club」網站之隱私權保護政策。我們希望您清楚瞭解我們使用資訊的方式，以及我們保障您隱私權的各種措施。當您瀏覽「wepeople.club」網站、註冊成為會員時，即表示您已閱讀、瞭解並同意接受本政策之所有內容。我們有權於任何時間修改或變更本政策之內容，建議您隨時注意該等修改或變更。您於任何修改或變更後繼續使用我們之網站服務，視為您已閱讀、瞭解並同意接受該等修改或變更。如果您不同意本政策的內容，或者您所屬的國家或地域排除本政策內容之全部或一部時，您應立即停止使用本服務。若您為未滿二十歲，除應符合上述規定外，並應於您的家長（或監護人）閱讀、瞭解並同意本政策之所有內容及其後修改變更後，方得使用或繼續使用本服務。當您使用或繼續使用本服務時，即表示您的家長（或監護人）已閱讀、瞭解並同意接受本政策之所有內容及其後修改變更。</p>
        <p>一、 Cookie程式的使用個人資料之取得當您以使用者進入「wepeople.club」網站瀏覽時，並不需要輸入任何個人資料，例如姓名或電子郵件地址等。 我們的網站可能使用cookie技術，以便於提供更適合您個人需要的服務；cookie是網站伺候器用來和您個人電腦瀏覽器進行溝通的一種技術，它可能在您的電腦中儲存某些資訊，僅會記錄您上站位址、以及在相關網站內的瀏覽活動紀錄，以便我們進行流量及網路行為的分析，從而改善網站服務品質，並提供您更個人化的服務。但是您可以自由經由瀏覽器的設定，取消、或限制此項功能，惟可能會導致本網站某些功能無法正常執行。僅會記錄使用者上站的位址、以及在相關網站內的瀏覽活動紀錄，以便我們進行流量及網路行為的分析，從而改善網站服務品質。</p>
        <p>二、 在使用者同意下提供的個人資料在某些情況下，例如當您註冊為「wepeople.club」網站會員、訂閱電子報、購物、使用相關服務或參加其他活動時，網站可能會要求使用者提供個人資料或註冊為會員，以便於和使用者聯繫、完成交易、提供服務、或處理訂閱程序；在此等情況下，網站或其合作對象將會事先告知使用者此等事實。</p>
        <p>三、 與外站連結「wepeople.club」網站提供之外站（非本集團所自行經營規劃之網站）連結，主要由廣告贊助之版面與連結設定，或旨在提供您相關參考資訊。您可能會因此連結至其他業者經營的網站，但不表示「wepeople.club」網站與該等業者有任何關係。其他業者經營的網站均由各該業者自行負責，不屬「wepeople.club」網站控制及負責範圍之內。「wepeople.club」網站對該等網站之內容不擔保其合適性、可依賴性、即時性、有效性、正確性及完整性。您也許會連結到一些令您厭惡或不需要的網站，遇到此類情形時，建議您不要瀏覽或儘速離開該等網站。</p>
        <p>四、 變更「wepeople.club」網站有權於任何時間修改或變更本政策之內容，建議您隨時注意該等修改或變更。您於任何修改或變更後繼續使用「wepeople.club」網站，視為您已閱讀、瞭解並同意接受該等修改或變更。如果您不同意本政策的內容，或者您所屬的國家或地域排除本政策內容之全部或一部時，您應立即停止使用。</p>
        <p>五、 與我們聯絡如果您對「wepeople.club」網站的隱私權政策或與個人資料有任何疑問，歡迎您以電話或電子郵件(wepeople.club@we-westeast.com)於上班時間與「wepeople.club」客戶服務中心(02)2754-8588聯絡。</p>
      </div>
    </div>
  </div>
</div>