<style lang='sass' src="pages/detail.sass" scoped>
</style>

<template lang="pug">
section.detail
  .top-back(@click='touterPre')
    .back
      i.material-icons
        | close
      span 返回前頁
  .all
    .detail-content
      .top
        h1.title 洪 鈺 堂 的 電 車 難 題
        h2.sub 把每個案子都當成「作品」
        p.date 2017年8月5日
      .text
        img(src="~images/hong1.jpg")
        .part
          p 洪鈺堂的電車難題
          p 口述｜洪鈺堂　文｜ 魏仁祥　攝｜曾曉童
        .part
          p 洪鈺堂，白輻射影像導演，大學主修資工，當時自學動畫，之後便一路往這方面發展。
          //- 談到近期網路上的仇恨言論，他不屑的盯著鏡頭發狠說道「我有檢舉他們，我天蠍座的。」
        .part.qa
          p.q 當初是怎麼會想要自己出來開公司呢？
          p.a 過去累積經驗的過程中，我發現自己還是會想要回到「做設計」這件事情。我記得之前工作的時候，有一陣子不太喜歡做設計，覺得同樣的工作做太久，做的東西不是我想要的。
        .part.qa
          p.q 有點像是跟同事一起玩工作的感覺嗎？
          p.a 我都還會記得......某些片刻哪個同事講出某個idea，或某一句話，或做的一段表演，會讓人覺得「欸～就是這個！」這個狀態是很棒的！日後再去看那些腳本會覺得很好笑——那不就是誰誰誰嗎。有些案子我們會接，但我們的根是在這邊，我想把最好的給同事做。
        .part.qa
          p.q 所以你們會挑選客戶嗎？
          p.a 
            | 沒有那麼多案子可以挑啦（笑）。每一間公司的個性都不太一樣，我就希望我們是有自己個性的公司，比如說，有些案子預算真的不多，但實在太有趣了，而他的東西又缺動畫，或是想做動畫但預算不夠，那我一年大概會設定做兩到三個這樣的案子。這種案子的價值觀和空間都很大，我覺得做起來都比有錢但沒有空間的案子來的愉快。
            br
            | 我會站在同事的立場想說「這個案子大家好像可以做一下～會蠻好玩的」，畢竟同事也不是公司的工具。其實有沒有錢真正痛苦的人只有我，同事也感覺不出來這個案子有沒有錢。
        .part.qa
          p.q 除了考量金錢之外，接與不接還會考量什麼？
          p.a 有沒有趣、能不能發揮這一直以來很重要，錢是一回事，我會盡可能把我們的獨特做出來，剛開公司的時候會遇到很想玩但沒有辦法的情形，後來有能力就會慢慢多出一些選擇。另外要不要合作也是會考慮客戶有沒有尊重我們，是不是只把我們當作操作軟體的手。
        .part.qa
          p.q 那如果你們要做的東西與客戶的要求有衝突怎麼辦？
          p.a 
            | 我們有遇過客戶要求「這個拿掉」、「這個加進去」像是配套餐一樣，這個在一開始你就會感受到，不要做比較好，除非他真的很有錢（笑），不然我們希望每一個案子都可以是做作品。
            br
            | 我盡可能會爭取一些空間，一旦跟客戶變得對立就會很累，很多設計沒有辦法做下去，你會做得很痛苦，名聲也會受影響。
        .part.qa
          p.q 怎麼爭取空間呢？
          p.a 
            | 我在公司的責任就是盡量的跟客戶達成共識，像是「客戶有沒有想要把這個作品做好？」假如說他沒有想要得到一個好東西我就不會想接。另外有些客戶從來沒有做過動畫，那就很考驗我們的溝通能力，動畫要改真的超難，所以我們通常會做很多階段的溝通，中間不斷去確認、控管。如果最後迫不得已需要修改的東西設計師沒辦法接受，那我就只好盡力做好客戶版，然後再做一個自己滿意的導演版。
            br
            | 我們也有遇過一開始設計有共識，但到最後一關被上面的人不喜歡而否決，最慘的是沒拿到錢，這些都有，難免會遇到。
            br
            | 到後來我們很多客戶都是固定的，彼此要的東西有共識，合作起來很開心，他們也會介紹其他客戶、其他合作可能。所以我覺得一開始就要想清楚我們要的是什麼——只要賺錢嗎？還是每個專案都是作品？久了之後就會有累積，就會有差別。
        img(src="~images/hong2.jpg")
        .part.qa
          p.q 聽說你們總是花了很多心力在前期的概念發想上。
          p.a 
            | 動畫影像是有功能性的，秒數和節奏大概都有個固定，你要在事前就規劃好：目標是要洗腦？還是有個印象就好？這個影像怎麼被使用？放在空間播放還是放在螢幕？播放的大小是什麼？有沒有可能再做更多好的擴大？要不要做互動？我都會多問，而不是不問就開始做，這是學生比較缺乏的。
            br
            | 另外，你做久了就會慢慢知道有些事情有節奏在，廣告15秒跟30秒的敘事就不一樣：30秒你可能還有個鋪陳，但15秒沒有時間給你鋪陳，要在一開始就形成一個氣，而那個氣你要去觀察。
        .part.qa
          p.q 以你們工作室的角度來講，會怎麼看來應徵的學生？
          p.a 
            | 我們收到履歷都差不多，一開始是自我介紹，然後是攝影啊插畫啊，全部的人都一模一樣，那以白輻射要找graphic設計來講，我就只能從他寫信的內容看他怎麼表現他具備的能力，或是誰的作品比較成熟，誰的氣質是最明顯的。
            br
            | 學生在程度上最大的差別在於——有些學生是很有野心的，他們會把畢製或參與的活動當做一個project在做，而不是for學校的東西。這樣的學生野心很大，所以他在工作時所投入的心力就沒有在跟你客氣的。
        .part.qa
          p.q 我們看到你會去許多學校演講、開工作坊，或擔任評審。在你與學生接觸時，有沒有看到什麼特別的點？
          p.a 
            | 學生本來就沒有經驗嘛，團隊合作的經驗也沒有，學校畢製也是這樣——一群沒有經驗的人聚在一起，做事方法都是摸出來的，那太浪費時間了。如果老師沒有心力帶那麼多組的話，可以找業師一起帶，去年台科有幾組找我去看動畫，我覺得那樣的討論很直接，可以針對成熟度去討論。
            br
            | 這件事情我印象很深刻，因為我在學生的時候就很希望學校會做這樣的事情，業師在帶的過程就會讓學生得知業界的一些狀況。但我覺得畢製還是應該要讓學生做他還是學生想做的事情，這件事可能你去工作就會沒有心力去完成，或過了某一段時間就沒有那個敏感度，而學生很多缺乏的資源就只是沒有人去教他們。
        .part.qa
          p.q 你會不會認為這是學校教育的失靈？
          p.a 
            | 大學有些老師要升等很忙，其實無力感很重。教設計你常常會聽到很多老師都不教基礎沒教什麼，其實我覺得學校是一個窗口，他們願意打開、引薦、連接自己的校友，或是跟外界做串連會比較好，你沒有辦法期待學校老師什麼都要教你。
        .part.qa
          p.q 最近社會上有許多設計相關的議論，像是抄襲、本土文化、變電箱、街道美學......對於這些討論你會怎麼看？
          p.a 
            | 我很不喜歡批評事情，因為批評真的太容易了。其實我自己以前也會憑個人好惡去看作品或評論事情，到後來你創作時就會發現：很多東西是不能放在一起討論的，很多東西發生的背景、製作的條件都不同，你只能去討論它可以怎樣做會更好，或它有做了哪一些有趣的改變。
            br
            | 從事設計的人會知道，有些結果不都是設計師的錯，或者是客戶的錯，更多的時候是各種錯加在一起才得到的結果，或是很多條件加在一起折衷出來的，可是你不能因此就否定整個作品。很多最後的「不理想」，其實大家都知道它可以更好。
        .end-text
          p 白輻射影像把他們的每個案子當成作品在做，要求出品的影像要讓社會有感，而非只是網路世界美麗過眼的一瞬。放眼蔡英文競選動畫、第25屆金曲獎入圍動畫、捷運進站宣傳影片......白輻射影像出手製作的許多作品所引起的好評並非只有侷限在設計圈同溫層裡。
        .author
          p 白輻射
          a(href="http://whitelightmotion.tv" target="_blank") http://whitelightmotion.tv
        img(src="~images/hong3.jpg")
        ShareBar
        .p-logo
          img(src="~images/product-logo2.svg")
</template>

<script>
import { mapGetters, mapActions } from 'vuex';
import ShareBar from '../ShareBar';
export default {
  data() {
    return {}
  },
  head:{
    title: {
        inner: '洪 鈺 堂'
    }, 
    meta: [
      { property: 'og:title', content: '洪 鈺 堂｜讓我搭一班會爆炸的電車' },
      { property: 'og:image', content: 'assets/images/hong.jpg' },
      { property: 'og:url', content: location.href },
      { itemprop: "image", cpntent: "assets/images/hong.jpg" }
    ],
  },
  created() {
  },
  computed: {},
  methods: {
    touterPre (){
      this.$router.push('/');
    }
  },
  mounted() {},
  destroyed() {},
  components: {
    ShareBar
  }
}
</script>