<style lang='sass' src="pages/detail.sass" scoped>
</style>

<template lang="pug">
section.detail
  .top-back(@click='touterPre')
    .back
      i.material-icons
        | close
      span 返回前頁
  .all
    .detail-content
      .top
        h1.title 賴 佳 韋 的 電 車 難 題
        h2.sub 千千萬萬種設計怎麼可能只有一種解法
        p.date 2017年8月25日
      .text
        img(src="~images/lai1.jpg")
        .part
          p 賴佳韋的電車難題
          p 口述｜賴佳韋　文｜ 魏仁祥　攝｜陳沛恩
        .part
          p 「我還在其他設計工作室當助理的時候，曾經有三個月沒有放假過，六日都要去工作室工作，每天出門不知道什麼時候回家。」採訪當日賴佳韋早上七點才睡，下午一點受訪時還沒吃早餐，「現在長久住在台北，很緊繃的環境當中，我比較容易適應、逼自己在這樣的戰鬥狀態。」
        .part.qa
          p.q 做案子時會遇到什麼樣的掙扎呢？
          p.a 
            | 我自己接到每一個案子時候都會充滿理想和目標，覺得這個東西應該要做成某種樣子，但接觸過後就會知道並不是那麼理想，可能客戶業主會很多限制，或是你本身的狀態不夠理想，幾乎每個案子都會有這樣的拉扯。
            br
            | 當然還是會有把你的電力磨損掉的那種案子，那如何重燃這個案子的熱情與電力，而不是抱著「算了啦，我把這個東西做完就好」這種想法。有些設計師被案子折磨，為了生活下去，心態變成只想交差，這是一件很可怕的事情。
        .part.qa
          p.q 你是如何重燃對案子的熱情與電力呢？
          p.a 
            | 我會重新設定自己對案子的設想。當業主賦予你一個框架去完成這件事情，你能不能從框架找到一些你憧憬的目標、熱情？我覺得這可能是設計師成熟的一個過程。
            br
            | 舉例來講，我還很年輕的時候如果東西被否決，一方面打擊很大，開始懷疑自己的能力，一方面心裡很反彈，會覺得「你不懂」或是「你怎麼會覺得這個不好」，很容易不喜歡而不要這個案子；但一個成熟的設計師會明白一個案子有行銷、市場......很多層面，當業主提出某些條件，他會從裡面再去調整方向，發展出另一個面向的東西。
        .part.qa
          p.q 開始這麼思考後有什麼改變嗎？
          p.a 
            | 世界上有千千萬萬種設計，大家詮釋同一件事情的角度都不太一樣，所以怎麼可能只有一種解法？當客戶否決你的東西，他只是覺得這個解法不符合他的期待，那設計師應該成熟的思考出別的解法，否則作為設計師，你還如何能夠使一般大眾以新的角度觀看世界？
            br
            | 如果客戶只要限制你一題你就不會解這個設計，那這是一個很好的、合格的設計師嗎？後來想通這點對我影響很大，開始從挫折裡面找到一些樂趣、方向，甚至感到蠻過癮的。
        .part.qa
          p.q 你在什麼專案中特別感到這種過癮呢？
          p.a 講去年做的韋禮安的專輯好了，是個蠻酷的經驗。他一開始就設定我的封面要把QRcode放進去，但在做這個案子之前，其實我是非常、非常、非常討厭QRcode，非常不喜歡他太突出搶眼的造型。這個限制對我來講非常大，一開始其實也很掙扎要不要做這件事情，它違背了我做設計能不放就盡量不放QR code的原則，那既然我覺得QRcode這麼醜，又要放到封面，我要如何把它變漂亮？這是當時我最大的課題。
        img(src="~images/lai2.jpg")
        .part.qa
          p.q 大集團下面有各種子公司，可能你不認同A子公司的行為，但找你來做設計的是B子公司，而無論如何都會讓同一個老闆獲益，你怎麼看？
          p.a 
            | 我很難去界定、評斷這個集團的好壞，因為現在網路上太多的言論了，一般人不知道那些到底是不是事實、是不是對手的指控。其實現在我連公民記者都很質疑，因為太多太多是我看不到的部分，所以很難判別是不是該相信。
            br
            | 如果不認同這個東西，其實我也做不太出來，或者會做出一個很黑心的樣子。對我來講，我專注的是我經手的東西——它是不是對這個社會有壞處？如果這個商品對社會有益處，我想我會毫不猶豫地接受。  
        .part.qa
          p.q 設計除了符合業主的要求這個責任之外，在文化上你會不會覺得有什麼責任？例如說，漢字的使用。
          p.a 設計師當然會有社會責任或文化上的責任，但一般做設計的當下，設計師其實非常渺小，只是過程中小小的一個環節而已，我自己很難想得那麼深沉，我想的都是如何讓這個東西變得更對、更好、更被看到。只是想著利用某一個設計去影響、改變整個社會是很難的，這是漫長的累積，事後探討評論才會發現。
        .part.qa
          p.q 有遇過不知道該不該接的案子嗎？
          p.a 倒是不會，以前還是新人的時候什麼類型都接，後來開始發現有些東西自己駕馭不了。那些經驗讓我知道這類型的東西如果找我的話，我應該要更果斷地拒絕，如果硬去接不適合自己的東西，對自己或對客戶其實不是一個很負責任的狀態。
        .part.qa
          p.q 在剛開始獨立接案的時候，有被生活逼到必須要低價接案嗎？
          p.a 
            | 我沒有很低價接過稿耶。但大家會去想找剛出道的設計師決大部分是因為你比大設計師便宜，又因為很菜所以可以百分之百配合。通常找你的案件都很急，因為知名設計師檔期都已經排滿了所以才會找到你，你就只能在那種錢又少時間又很趕的狀態下硬接好多個案子，例如今天剛收到這個案子，我隔天就要提案，後天要把東西交出去。
            br
            | 以前我都會說，設計師很像鴨子划水，表面看起來很平靜，實際上你在底下要做很多事情，很慌亂，不是一般大眾認知的很美好很雅痞那樣。
        .part.qa
          p.q 案子這麼滿的情況下心理負擔會不會很大很累？
          p.a 過程抗拒、反抗的心裡好像都沒有過，只是覺得好像還可以做得更好。我很習慣在某種戰鬥狀態下工作，那種模式極限是很大的，可能睡很少或不睡也不太會覺得累。熬夜趕稿對我來講不是太大的問題，我很享受很用力、很瘋狂的把東西做好，很希望自己的設計品被擺在架上掛自己的名字，可能對有些人來講太工作狂了，但對我來說這就是設計師生涯的一部分。
        .end-text
          p 賴佳韋，嘉義人，經營賴佳韋工作室，執行的案件多是書籍裝幀與唱片包裝，工作室有一整牆的書櫃，裡面的書多到必須排成兩排。曾在臉書開玩笑「珍惜生命，遠離設計」，但其實他對設計工作滿腔熱忱，買了PS4很久卻忙到沒時間玩。
        .author
          p 賴佳韋工作室
          a(href="https://www.facebook.com/davidlaiworkshop/" target="_blank") https://www.facebook.com/davidlaiworkshop/
        img(src="~images/lai3.jpg")
        ShareBar
        .p-logo
          img(src="~images/product-logo2.svg")
</template>

<script>
import { mapGetters, mapActions } from 'vuex';
import ShareBar from '../ShareBar';
export default {
  data() {
    return {}
  },
  head: {
    title: {
      inner: '賴 佳 韋'
    },
    meta: [
      { property: 'og:title', content: '賴 佳 韋｜讓我搭一班會爆炸的電車' },
      { property: 'og:image', content: 'assets/images/lai.jpg' },
      { property: 'og:url', content: location.href },
      { itemprop: "image", cpntent: "assets/images/lai.jpg" }
    ],
  },
  created() {
  },
  computed: {},
  methods: {
    touterPre() {
      this.$router.push('/');
    }
  },
  mounted() { },
  destroyed() { },
  components: {
    ShareBar
  }
}
</script>