<style lang='sass' src="pages/detail.sass" scoped>
</style>

<template lang="pug">
section.detail
  .top-back(@click='touterPre')
    .back
      i.material-icons
        | close
      span 返回前頁
  .all
    .detail-content
      .top
        h1.title 廖 小 子 的 電 車 難 題
        h2.sub 隨便說好，折損的不是只有自己而已
        p.date 2017年8月18日
      .text
        img(src="~images/liao1.jpg")
        .part
          p 廖小子的電車難題
          p 口述｜廖小子　文｜ 魏仁祥　攝｜曾曉童
        .part
          p 「一隻老虎的牙齒放在你面前你可能不會覺得怎樣，但如果加上牠的毛、牠的眼睛、牠的肌肉，你會拔腿就跑，腿都軟了尿都噴出來了。」他說，「最銳利的那一面，背後有那些軟的東西，才會讓牙齒有力道。」談到此事，他的聲調放軟許多。
          p 廖小子個性爽直，聲音與作品一樣宏亮充滿剛勁，有時聽完問題後會先陷入沉思，原以為他的回答會簡練樸直，不料幾秒後，一開口便是奮進的氣勢，歷史脈絡與社會學信手捻來。為了落實節能反核的立場，小子不開冷氣，也不吹電風扇，受訪時他穿黑色吊嘎，滿臉是汗也鮮少見他伸手去擦。
        .part.qa
          p.q 你會覺得你在作品裡加入本土元素是在實踐身為平面設計師的文化責任嗎？
          p.a 
            | 我覺得這是人家強加諸在我身上的，實際上我在一開始做的時候並沒有這樣的意識在裡面。
            br
            | 一開始做的案子跟現在做的類型差異很大，像是言情小說的封面，或小廠牌化妝品的DM，客戶一直狂改稿，希望字可以放很大、顏色很鮮豔、圖要修的很沙龍、鋪個玫瑰，再加上外框與陰影。我本來覺得很痛苦，但之後就想：既然打不過他那就加入他，而要做就要做到自己很滿意的地步。久而久之「把字放很大」、「挑戰字的裝飾性的可能」......等等就變成自己的風格。
            br
            | 另一方面，小時候我家裡是勞工階級，會接觸到那些廟宇啊、招牌啊、卡車噴漆之類的，我在思考「我要找什麼東西來做？」、「我可以怎麼去做？」的時候，會很容易往那些方向去想。這些東西從小跟我一起長大，所以對我來說並沒有先入為主「醜的概念」——我到長大之後才有人跟我講那是醜。
        .part.qa
          p.q 重視自身經驗的挖掘這點，是不是與你在美術系所受的訓練有關？
          p.a 是。從自己的生活、成長背景去想，這樣的思維是美術系給我的教育。我是在那樣的環境裡長大的，所以對我來說自然而然會應用那些元素，我一直在做這樣的事情。後來人家來跟我講這是「庶民風格」，或是什麼「很本土」，被這樣稱呼我也沒有覺得哪裡不好，所以就讓他們繼續這樣講。
        .part.qa
          p.q 被這樣講完之後也沒有什麼改變，就繼續這樣做是嗎？
          p.a 我是被迫樣這樣做的，因為我就在這樣的背景裡長大。而被這麼講之後，我也是會從那些東西再去延伸，更多的去觀察自己的環境。
        .part.qa
          p.q 在之前的報導中你有提到，你會希望透過使用一些台灣街頭中的元素，讓大家回過頭來發現身邊那些元素值得欣賞。可是一個符號讓人感覺親近，不一定會讓人覺得美。
          p.a 
            | 應該說，我用這些元素是希望讓人家覺得台灣街頭有一定可愛的地方。
            br
            | 像我做李英宏那張專輯用噴漆，但之後大家在產業道路上看到「你要工人」的噴漆時，不一定要很驚訝在那邊看半天，左拍右拍看半小時，不用這樣！！（笑） 而是大家會發現那些元素是台灣街道一個可愛的地方，值得珍惜，有更多的可能性，哪一天在新聞上看到有人要把老房子拆掉的時候，不會無感地覺得這是可以的！那些元素大家不一定要買單，但我希望能埋下這樣的種子。
        .part.qa
          p.q 而在另一篇的報導中，你提到中華藝校官網首頁創意無限，怎麼說呢？
          p.a 當時舉中華藝校只是個例子，那種感覺就很像我看到蓋台廣告一樣——我自己能夠把所有元素拆開來，然後再重組。如果我重新組合，說不定可以做出一個前衛的作品，所以在接觸那些作品的時候，我都會以「如何去拆他們」這樣的視角觀看。
        img(src="~images/liao2.jpg", alt="")
        .part.qa
          p.q 現在社會上很多人在反省台灣對視覺設計不夠重視，可是許多商家或團體並沒有經費負擔這一塊，你會覺得平面設計師應該扮演什麼角色嗎？
          p.a 
          | 我並不認為設計師有這個社會責任要用低價幫人家做東西。如果你覺得他們的故事很感人，東西很好但不知道怎麼推，你有心想要幫助他們，fine，我覺得這個心是很好的，但那並不是設計師的社會責任，設計師不是革命家不是救世主，我們其實就是生意人，我們的確很單純就是生意人。
          br
          | 這件事情還蠻嚴重的，因為設計師是一個軟專業，我們沒有辦法有一個六法全書、會計證照，或是醫師執照來搭配顯得我們很專業，所以這個社會會感覺「你想一想、簡單畫一畫就好了」，或是「這個很簡單我也可以做」。當你無償去幫別人的時候，你等於讓對方確認這件事情：對，設計真的是很簡單就可以拿到，不需要太大代價、付出、努力。這會讓設計師背後的專業素養跟絞盡腦汁的思考越來越不被看見。
        .part.qa
          p.q 這樣是不是會變成一種惡性循環？
          p.a 
            | 你盡到了一時的古道熱腸，但對方可能會跟他的朋友說「你去找那個設計師啊，搞不好他可以免費幫你做，搞不好他想一想，隔天、一個禮拜就可以幫你了。」最後你身邊環繞的都是這樣的案子，客戶更加看不到你那一個禮拜是多絞盡腦汁，看不到你是花了多少年的時間，才能夠濃縮到一個禮拜完成。當十個二十個三十個設計師這樣做的時候，這對設計圈來說是一個很可怕的戕害。
            br
            | 所以我才說，設計師從來沒有責任以極低價的方式幫窮苦的人做稿子，相反的，設計師有責任要讓設計費變得越來越高，使更多的人覺得設計非常的有價值，進而讓設計師有更大的責任義務幫客戶更茁壯，這才是設計圈應該要有的健康成長方向。
        .part.qa
          p.q 專業的設計師值得專業的價格，但專業很難定義，不同專業的程度也會有不同價格，如果一般民眾分辨不出什麼是專業怎麼辦？
          p.a 
            | 每個設計師的價錢當然不太一樣，但其實我本身不是很喜歡學生價。你出來接案的時候，就不應該存著「我是學生」這種僥倖心態，應該以專業人士的角度去解決客戶的所有問題，收一般正常的錢；而相對來說，因為你的經驗不足所產生的任何問題，都應該要絞盡腦汁去解決，想辦法克服，問人啊還是幹嘛的。
            br
            | 如果你以設計師的身份出來接案子，卻沒有一個設計師該有的素養，那設計師應該要捫心自問：還接什麼案啊？好像是你去開機車行卻不會修機車，你開診所有些病你不會看，這是一樣的道理，如果有些病你不會看你是不是應該把它轉介出去，或是不應該開診所。
            br
            | 當你出來接案子的時候，就不再是代表你自己了，而是代表整個設計界——整個台灣的設計界。所以千萬不可以隨隨便便說「好，我幫你！」這句話折損的不是你個人，而是整個設計界。
        .end-text
          p 廖俊裕，人稱小子，a.k.a. Godkidlla，作品風格強烈，常被定位為最具有本土特色的平面設計師，在清新與歐美氣味當道的年代，他的作品儼然是一道異音。小子從大學便開始接案，遇過無償比稿、超低報酬等鳥事，他心疼建議新人遇到類似情況盡量不要接。
        .author
          p 小子 Behance
          a(href="https://www.behance.net/godkidlla" target="_blank") https://www.behance.net/godkidlla
        img(src="~images/liao3.jpg")
        ShareBar
        .p-logo
          img(src="~images/product-logo2.svg")
</template>

<script>
import { mapGetters, mapActions } from 'vuex';
import ShareBar from '../ShareBar';
export default {
  data() {
    return {}
  },
  head: {
    title: {
      inner: '洋 蔥 設 計'
    },
    meta: [
      { property: 'og:title', content: '洋 蔥 設 計｜讓我搭一班會爆炸的電車' },
      { property: 'og:image', content: 'assets/images/liao.jpg' },
      { property: 'og:url', content: location.href },
      { itemprop: "image", cpntent: "assets/images/liao.jpg" }
    ],
  },
  created() {
  },
  computed: {},
  methods: {
    touterPre() {
      this.$router.push('/');
    }
  },
  mounted() { },
  destroyed() { },
  components: {
    ShareBar
  }
}
</script>