<style lang='sass' src="pages/detail.sass" scoped>
</style>

<template lang="pug">
section.detail
  .top-back(@click='touterPre')
    .back
      i.material-icons
        | close
      span 返回前頁
  .all
    .detail-content
      .top
        h1.title 聶 永 真 的 電 車 難 題
        h2.sub 面對低品質的輿論，政治類設計案還要接嗎？
        p.date 2017年9月1日
      .text
        img(src="~images/nie1.jpg")
        .part
          p  聶永真的電車難題
          p 口述｜聶永真　文｜ 魏仁祥　攝｜陳沛恩
        .part
          p 談到是否該將本土文化元素置放到平面設計作品中，聶永真的回答很堅定，「無論如何，我們做出來的東西都還是會有這個土地的氣味。」他說，「在不刻意把本土意識加進去的情況下，拿出來的作品跟日本、中國比較，我們依然看得出這些作品來自不同地域，有某種特定的氛圍。」
        .part.qa
          p.q 之前你在臉書寫道，國民黨高報酬的案子你們應該不會接，那假設一個比較模糊的狀態：某一個政黨十個政策中，有三個你非常同意，而七個不同意，這樣接與不接的界線會怎麼思考呢？那如果認同九個政策，剩下的那一個議題會壓迫到少數族群，會不會覺得自己有責任？
          p.a 
            | 會有責任，如果是三七那樣的比例的話，可能就不太會接，對我們來講認同的價值觀的比例夠高才會去做這件事情。
            br
            | 其實在接的時候，不一定能夠看到客戶一次提出十個政策給我們看，我們只能從他之前的經驗史去判斷他比較支持的價值觀。真正開始參選的時候，他們會丟出很多新的政策作為競選籌碼，我們也是邊做、邊看才知道他們會推行什麼。
            br
            | 另外我也有一個比較大的盲點——其實每個人推出來的政策看起來都是優勢的東西，比較難找到缺點，或看出來這會壓迫到什麼，其實建立在九比一的假設上，我也不確定能不能回答出要不要接......因為我也要有足夠的時間study這件事情有沒有問題。在現況中比較有可能會發生的問題是當選之後，這些政見有沒有一一兌現？
        .part.qa
          p.q 在接了政治案件後，你們還會想再接觸嗎？
          p.a 
            | 這兩三年最兩難的一件事情就是要不要接政治的案子。在沒有接之前自己會預想可能會很可怕，一種是客戶資質很差，做出來的東西可能會很糟，而如果是好客戶，東西做出後會排山倒海大量的湧入對立方的留言，酸你啊之類的，那你準備好了嗎？
            br
            | 我不確定我們還會不會接政治相關的案子，那是很大很大的心理折磨，也不是怕到，就是看到品質不好的輿論會很失望很疲累，但其實扣除政治這一塊，每一個案子都會碰到這樣的事，沒辦法，你就是做設計，東西被廣泛的傳播本來就會有反面的聲音，就是得面對、知道他們的存在。
        .part.qa
          p.q 若是以商業案來說 ：大型企業下，子公司A找你做案子，可是你不認同子公司B 的所作所為（可能是黑心食品，可能是不環保商品），而AB最終的獲益都會到流到同一處，這樣你會覺得平面設計師也有責任嗎？會不會擔心間接的助長那個資本更加膨大，間接壓縮到一些比較小的優質企業的發展？
          p.a 
            | 我覺得要看不相關性的程度。我們做city cafe那個案子也會考慮到統一的企業形象、發生過的事情對某些人來講是個問題，但統一超商其實算是另外一個組織結構，他們的背景可能是不同脈絡的，我會去比較相關的比重。
            br
            | 我今天主要是想要讓大家看到：其實每一個人都值得擁有一個非常簡單、好看的咖啡杯，我覺得這件事很重要，想讓它被看到、被傳播開來，因此有這樣的抉擇。這一兩年的確有一些爭議的企業找我們做，報酬也很高，其實我們都沒有接，一定會推掉。
        .part.qa
          p.q 是不是在出道的時候可能因為經濟條件不好而沒有資本去推掉案子？
          p.a 
            | 真的是有可能因為這樣而接欸，但也有可能那時候很懵懂，很多的社會觀感、道德良知、意識形態沒有那麼的清楚，我也是到後來才越來越明白。另一方面，新人做東西出去沒有人會知道你是誰，而你就是要這筆錢，我現在也是假設——當時出道我搞不好會不小心接到那種案子。
        .part.qa
          p.q 剛出道時有沒有遇過報酬超低但不得不接的情況呢？
          p.a 
            | 出道的時候我也不知道業界的價格是怎麼樣，所以就讓客戶開價，我都是透過客戶開價給我，我才會知道「喔～原來最少可以開到這樣子」，之後大概有一個range知道要抓到多少錢。
        .part.qa
          p.q 那如果對於剛出道的新人來講，會不會擔心這樣破壞行情？
          p.a 
            | 剛剛的例子，其實也都是建立在客戶體質很健康的情況下，所以他給你的費用不會過低，那萬一體質不良的客戶開出一個爛價錢的時候怎麼辦......我不知道（笑），每個人對於那個價錢多爛的底線其實不一樣，可是如果是非常容易評判很差的報酬，我覺得可能要盡量避開來，一位通常會開出這樣價錢的客戶，他本身在sense上也可能會有一點點需要討論——如果你sense夠好，就可以認知到你即將付費的東西關係到你的品質，你給出來的價錢反映的是你品牌的價值。
        img(src="~images/nie2.jpg")
        .part.qa
          p.q 你會怎麼看待本土元素在平面設計的運用呢？
          p.a 
            |我覺得那是很重要的事情，但沒有刻意一定要。當我們討論要不要把本土元素放進來，這也要看case適不適合。無論如何，我們做出來的東西都還是會有這個土地的氣味，因為在一個社會、社群，我們做設計的形式、經驗，都會被周遭的環境所影響，所以今天在不刻意把本土意識加進去的情況下，拿出來的作品跟日本、中國比較，我們依然看得出這些作品來自不同地域，有某種特定的氛圍。
        .part.qa
          p.q 前一陣子網路上有人討論設計全球化很嚴重的問題，你會怎麼看？
          p.a 
            | 在全球化的設計形式之下，在東西看起來非常平凡、每個人都會做、氾濫的情況下，我們回去思考周邊有什麼是特別的、與全球化不一樣的東西，反而會變得特別容易。其實它是相對的，當全球化很流行的時候，本土在地意識的推行相對就會被拉起來。全球化不代表不好，它是一個交流，而一旦你沒辦法在全球化的設計下做出某種個性、味道識別的話，我會覺得很可惜。
        .part.qa
          p.q 以前在學校的時候，你是怎麼培養自己的識別性？
          p.a 
            | 在學校時每個同學的設計程度都很好，所以看不出來誰比較特別比較不一樣，因為我自己企圖心非常強，自己就會有自己的哲學——想說我可以怎麼樣看起來不同？當別人覺得「你太敢了我不敢了！」的時候，我就成功了。其實每個人都是在找自己的一套理論。
            br
            | 其實「不要做安全感的設計」建立在大家都很好的脈絡下嘛（笑）
            br
            | （笑）我覺得基本功很重要，無論之後要做的東西多酷，你基本功一定要紮實到不行，我也不會覺得先做比較商業的案子是不對的，因為你要學會做酷之前，要先學會什麼東西都會做。要往某一個方向發展是你的選擇，但在這個選擇之前，可能會有十件事都要會做，最後才發現你做哪件事最好，你本來就要從那幾件你都做得很好的事情裡挖掘出做的最爽最快樂的事再繼續深入。
        .end-text
          p 聶永真，設計圈大家都知道他是誰。認為自我意識的覺醒永遠比學校給你的東西來得重要。放眼聶永真的作品，從大誌雜誌封面、蔡英文總統競選主視覺、金點概念設計獎海報......到各種書籍專輯裝幀，都能為港台設計圈注入新鮮的氣流，讓大家對設計的想像更加火熱騷動。
        .author
          p 永真急制Workshop
          a(href="http://aaronnieh.com" target="_blank") http://aaronnieh.com
        img(src="~images/nie3.jpg")
        ShareBar
        .p-logo
          img(src="~images/product-logo2.svg")
</template>

<script>
import { mapGetters, mapActions } from 'vuex';
import ShareBar from '../ShareBar';
export default {
  data() {
    return {}
  },
  head: {
    title: {
      inner: '聶 永 真'
    },
    meta: [
      { property: 'og:title', content: '聶 永 真｜讓我搭一班會爆炸的電車' },
      { property: 'og:image', content: 'assets/images/nie.jpg' },
      { property: 'og:url', content: location.href },
      { itemprop: "image", cpntent: "assets/images/nie.jpg" }
    ],
  },
  created() {
  },
  computed: {},
  methods: {
    touterPre() {
      this.$router.push('/');
    }
  },
  mounted() { },
  destroyed() { },
  components: {
    ShareBar
  }
}
</script>