<style lang='sass' src="pages/detail.sass" scoped>
</style>

<template lang="pug">
section.detail
  .top-back(@click='touterPre')
    .back
      i.material-icons
        | close
      span 返回前頁
  .all
    .detail-content
      .top
        h1.title 洋 蔥 設 計 的 電 車 難 題
        h2.sub 如果是以數字為優先導向，現在結局不會是這樣
        p.date 2017年8月11日
      .text
        img(src="~images/onion1.jpg")
        .part
          p 洋蔥設計的電車難題
          p 口述｜Andrew Wong、王慧娟　文｜ 魏仁祥　攝｜曾曉童
        .part
          p 「來來來，你們喝酒嗎？」木製地板，木製吧台，木製桌椅，洋蔥設計工作室的裝潢是大片的暖色系，牆面除了張貼過往的作品，也釘上許多店家的名片菜單。Andrew以酒代水招待我們，採訪之際，時而起身走向書櫃翻找提及的書籍海報，時而轉身向同事呼喊「開點音樂好了，太安靜了......壓力很大。」
          p 笑稱受訪壓力很大，當我們問起設計師的道德責任、餓肚子與破壞行情該如何抉擇，Andrew的答案多是簡單而堅毅。率性之餘，沒說出口的是經營一家中型設計公司所背負的責任。
        .part.qa
          p.q 從剛創立公司至今，在接案上有沒有碰過什麼兩難的情境？像是費用非常少，但不接會餓死。
          p.a 餓不死的啦，只是你可能會做得很痛苦，是那個痛苦讓你死，而餓讓你痛苦。其實每一個階段的想法會不一樣，從做科技產業，到後來做藝文產業其他產業，或是一個人做事、三個人做事，你要想的事情都不一樣，你要照護你身邊的人，那個覺悟也是跟著來的。
        .part.qa
          p.q 在剛出道的時候就這樣想嗎？
          p.a 上次在其他地方演講的時候突然意識到，有時我們並未把獲利擺到第一位，所以每個案子來的時候，會看好不好玩？有不有趣？甚至會花比預算更多的時間去投入；不是說我們不看重金錢，只是不要將獲利視為首要。恰巧我倆都不是財務背景，反倒可以專心在做某一些我們覺得重要的事情，如果在一開始我也是以數字為優先導向的話，現在結局不會是這樣。
        .part.qa
          p.q 平常你們接案都會考量哪些點呢？
          p.a 
            | 一般接案我們會考量時間、預算，還有表現空間大不大——三個點怎麼取捨平衡。對新人來講，累積出好的作品為第一要件，可能為了要讓作品好，而需要多一點的時間。等時間與表現都起來了，收入也會跟著起來。
            br
            | 新人要認真累積自己的作品，每一次機會你好好做，認真當成自己的案子，客戶給你什麼樣的委託，就認真去替他解決問題，這樣你才能帶來後面好的效應，為你帶來好的客人，好的作品，好的關係，或是好的機會。用預算來衡量一切才是最傻的，年輕剛出來，作品最重要，有好的作品才有往後走的本錢。現在網路那麼發達，如果你做得好，機會也會來的。
        .part.qa
          p.q 現在中國提供很多高報酬但表現空間很少的工作機會，你們會怎麼看？
          p.a 
            | 台灣、香港市場很小，有很多侷限，但現在世界高度開放，不是只有範圍跟區域，競爭是全世界的，你不會只看「在中國做」還是「在台灣做」，你一定有其他的可能性。
            br
            | 很多朋友去中國是為了要在階段性獲取最多的金錢，而且他在那邊有舞台可以表現，可以跟很多一線的人合作。等他到取得足夠的經歷後，便可以做他自己第二階段的計畫。如果我們只是在原地，那其實你什麼都不會得到。
            br
            | 很多時候你在不同的階段會追求不同東西，而就有不同的取捨與損失，不會都是好的，你一定要所付出才會有所收穫。
          img(src="~images/onion2.jpg", alt="")
        .part.qa
          p.q 成功的商業包裝會引起注意、吸引購買，如果你服務的客戶是黑心食品或不環保的商品，你覺得設計師在裡面是有責任的嗎？
          p.a 設計師當然有道德責任要慎選客源並盡可能去瞭解產品與其製作過程，假若真有在不知情下協助了設計規劃，也須記取教訓而更為小心謹慎。
        .part.qa
          p.q 除了社會責任之外，設計美學上有沒有覺得平面設計師應該要負起什麼樣責任呢？
          p.a 我覺得我們本土人有責任要去把自身的文化挖掘出來。做設計有點像是做偵訊社，創意有些時候是discover出來的，並不是create出來的。
        .part.qa
          p.q 像是你先前在其他報導提的東方元素、華人元素嗎？
          p.a 那篇文章的設定就是想講華人文化，所以我會比較偏重討論那個，但其實我平常不會把這件事放得那麼重，因為每一個project都要用每一個project的角度去解決它。
        .part.qa
          p.q 東方元素的使用在國際上已經被討論非常非常多年了，以現今的設計趨勢來講，你會怎麼看待、處理這些材料？
          p.a 我跟楚格設計的Gijs Bakker討論過，他說一般看到標榜「東方」「中西合璧」的那種東西，已經被操作了幾十年了，大家都期待有更新創的發掘與表現；我們可能要用更不同的角度去解讀東方，以更巧妙的方法融在作品裡面。

        .part.qa
          p.q 那漢字在國際上還流行嗎？
          p.a 因為市場的關係，整個華文是崛起的，現在在behance上可以看到很多外國的作品都會嘗試使用漢字元素，這顯現了外國人對漢字的好奇。之前跟幾個新加坡的designer聊天，他們很羨慕台灣可以使用中英混合的編排設計，但其實有時候我也挺羨慕他們，可以只純粹地編排外文（笑）。

        .end-text
          p Andrew Wong，出生香港，談吐夾帶英文單字，保留著港腔。2000年他與夥伴王慧娟成立洋蔥設計。早期設計案較單一，而由於趨勢與市場的轉變，加上朋友恰巧引薦了藝文設計的需要，而開始經營不同類型的案件。
        .author
          p 洋蔥設計
          a(href="https://www.facebook.com/oniondesign/" target="_blank") https://www.facebook.com/oniondesign/
        img(src="~images/onion3.jpg")
        ShareBar
        .p-logo
          img(src="~images/product-logo2.svg")
</template>

<script>
import { mapGetters, mapActions } from 'vuex';
import ShareBar from '../ShareBar';
export default {
  data() {
    return {}
  },
  head: {
    title: {
      inner: '洋 蔥 設 計'
    },
    meta: [
      { property: 'og:title', content: '洋 蔥 設 計｜讓我搭一班會爆炸的電車' },
      { property: 'og:image', content: 'assets/images/onion.jpg' },
      { property: 'og:url', content: location.href },
      { itemprop: "image", cpntent: "assets/images/hong.jpg" }
    ],
  },
  created() {
  },
  computed: {},
  methods: {
    touterPre() {
      this.$router.push('/');
    }
  },
  mounted() { },
  destroyed() { },
  components: {
    ShareBar
  }
}
</script>