<style lang='sass' src="pages/detail.sass" scoped>
</style>

<template lang="pug">
section.detail
  .top-back(@click='touterPre')
    .back
      i.material-icons
        | close
      span 返回前頁
  .all
    .detail-content
      .top
        h1.title 顏 伯 駿 的 電 車 難 題
        h2.sub 設計師不應該做無良的設計
        p.date 2017年9月8日
      .text
        img(src="~images/yan1.jpg")
        .part
          p 顏伯駿的電車難題
          p 口述｜顏伯駿　文｜ 魏仁祥　攝｜曾曉童
        .part
          p 「美感到底是什麼？我們希望小孩擁有的美感是什麼？是判斷整齊、比例、分佈嗎？還是所謂透過美感讓思考更先進？還是什麼？」成長時深受歐美流行音樂文化影響，他說，「美感對我來說並不是美，而是一種思想上的突破。」
        .part.qa
          p.q 在成長過程中，那些強烈影響你的流行音樂文化在視覺上帶來什麼樣的啟發呢？
          p.a 為了表現追求反抗、自我追尋的精神，那些歌手必須刺激你的視覺，你才會感受他要講的議題。事實上像這樣的音樂跟革命的視覺是一樣的——你必須要引起大家對一個議題的關注，這是視覺傳達很大的一個營養，它除了傳播正向的東西，其實也有可能傳播煽動的、負面的東西，這就是視覺傳達傳遞語言能量的能力，那就不是美學的問題了。我們一般討論美學的時候，是在討論「設計的原理」，但有的時候我們討論的是「設計的語言傳達能力」，這裡面不只是美，還包含了醜，我們不要混在一起討論。
        .part.qa
          p.q 從這個視覺傳達觀看角度，你會怎麼看待前一陣子討論火熱的變電箱、街景？
          p.a 
            | 我分兩件事來討論。首先，我是贊同水越這個計畫的內容的，因為他們有研究，說實在話，設計的研究來自於西方包浩斯系統底下，所以在那個系統下做這件事合情合理合乎設計美學原理；那今天變電箱上的山水畫被請去國外展覽是另一件事喔，這是外國人看東方文化的獵奇心態，台灣的變電箱在他們設計體制底下不會出現，因此他們覺得這個東西很特別。
            br
            | 那怎麼樣保存？怎麼樣並容？如何引用西方的設計架構，卻又並容了自己的在地文化？才是我們要討論的事情，而不是全部抹滅這些文化，那等於是否定掉自己。
        .part.qa
          p.q 有沒有考慮過將本土元素融入你的設計中呢？
          p.a 
            | 我不會那麼直接，我自己也不會是這樣類型的設計師。我很喜歡檳榔文化、俗文化、廟宇文化......但我沒有辦法去做，因為教育背景不是在這，我的教育背景很西化，是聽西洋音樂長大的，所以沒有辦法，那是每個人教育的成長過程。
        .part.qa
          p.q 我們常會討論台灣環境的視覺不夠好看，可是很多單位沒有經費負擔視覺設計，那設計師需要什麼角色嗎？
          p.a 
            | 設計師應該應該扮演輔導而不是謾罵的角色啊（苦笑）。但千萬不能降低價格，當你面對一個沒有費用的團體時，你能做的就是跳脫金錢思考，像我會直接幫慈善團體做，那就變慈善行為了，不算設計規劃。當你進到金錢價值觀時，他沒經費去請設計你不能去逼，設計不是逼迫人去做的事情。
            br
            | 當然也可以想一個比較有趣的方法，可能成立一些工作坊或制度，或是交換計畫，比如說我提供你設計，你提供我什麼？那慈善機構就得去思考提供你一個課程什麼的，但交換還是會衍生一些問題出來，會不會成立我不確定。
        .part.qa
          p.q 在接案時，通常遇到的兩難是什麼？
          p.a 
            | 各種兩難都有，比方說時間不夠了，但你很喜歡的客戶找你做案子，怎麼辦？你要犧牲睡眠，還是犧牲這個機會？
            br
            | 考慮事情的時候，不外乎就是時間、成本、跟人事，兩難一定是這幾件事情有了衝突。時間有沒有辦法調度？有沒有辦法少睡一點？有沒有辦法找人幫我一起分擔？如果我缺人手，那有沒有辦法在最短的時間找到符合的人？成本的話，錢太多你不一定敢吃喔，因為你不知道他背後隱藏了什麼問題。所以什麼樣的問題，用什麼樣的方式解決，有經驗最重要，有經驗你才大概知道結果是什麼，要有心理準備。
        .part.qa
          p.q 會不會把有趣納入考量？
          p.a 
            | 會！我非常在乎有趣！可能我吃了一個錢很多的案子後，可以做三個有趣的案子，用換算加加減減排列組合這樣。但我本身還是盡量以好玩為主，好玩才有辦法做得開心，結果大家都滿意。
          img(src="~images/yan2.jpg", alt="")
        .part.qa
          p.q 從出道到現在，會不會有選擇客戶的困擾？
          p.a 
            | 我沒有用「挑客戶」去想事情，我覺得跟客戶相處就是交朋友，你們會挑朋友......慢慢挑越挑越好嗎？不會。一樣的道理，當大家想挑客戶的時候本身就是個問題了。
            br
            | 我的設計哲學中有一個很重要的東西是溝通，如何透過溝通跟別人學習進而影響創作？成見與無法反思是溝通最大的阻礙。大家比較直覺的「溝通」是指「話術」或「說服術」，但我不是在講這種，話術是種工具，之前有人問我怎麼說服客戶，我聽到就想「我沒有在說服客戶～」如果我講的東西客戶不喜歡，我也會有點失落，可能就不會合作了，但我不會跟你講說「買啦買啦，我的設計現在最紅，你買了一定會中！」那就是話術。
        .part.qa
          p.q 有沒有遇過黑心食品或不環保商品找你來做設計，會覺得自己有責任嗎？而如果是某間公司一些產品被發現是黑心的，可是他找你設計的不是那個部分，又會怎麼思考呢？
          p.a 
            | 有欸，還是有碰過，應該說他不自覺的吧，也是可能是做到最後才發現對方有問題，老實說那種會慢慢去避免，跟他們價值觀選擇不一樣。那如果事先知道那是黑心商品，我不會做。
            br
            | 我覺得賺錢的管道很多，所以那個企業有問題的話，也是會避免。美國的設計圈現在全部都在倡導這件事——設計師不應該做無良的設計，也不要為那些無良的企業設計，你們出來選擇很多，可以不要做那樣的東西。
            br
            | 設計師的能力是在把議題傳達出去，跟刺激人們對一件事情的關注，所以我們也有能力讓大家買黑心商品，這是設計師的能力，我們應不應該？我們不應該。我們既然有能力讓大家關注這件事情，就不應該誤導人們做一些不好的東西，但確定大家都知道每個公司幕後的祕密嗎？不見得都知道事情的全貌，知道的話，當然就不要。
        .part.qa
          p.q 最後，對於台灣設計、美感教育，你有什麼樣的看法嗎？
          p.a 
            | 我們要討論何謂美感？美感到底是什麼？我們希望小孩擁有的美感是什麼？是判斷整齊、比例、分佈嗎？還是所謂透過美感讓思考更先進？還是什麼？
            br
            | 以我自己的成長經驗來說，美感對我來說並不是美，而是一種思想上的突破，比如當年印象派，你說他是印象派，是因為他突破當時繪畫的觀點，所以文藝復興之後，我都覺得美是思想革命，那我們要求小孩的美感教育是不是要教他們思考的方法，或者是判斷事情的方式？
        .end-text
          p 顏伯駿，操刀第28屆金曲獎主視覺，執行了多項知名藝人的專輯包裝，融歌手品牌形象於視覺中。顏伯駿從大學開始接案，一畢業便獨立接案至今，他認為剛出道適合從文宣做起，等累積足夠的商業經驗再接品牌規劃較為合適。
        .author
          p 三頁文
          a(href="https://www.facebook.com/yenpochundesign/?ref=br_rs" target="_blank") https://www.facebook.com/yenpochundesign/?ref=br_rs
        img(src="~images/yan3.jpg")
        ShareBar
        .p-logo
          img(src="~images/product-logo2.svg")
</template>

<script>
import { mapGetters, mapActions } from 'vuex';
import ShareBar from '../ShareBar';
export default {
  data() {
    return {}
  },
  head: {
    title: {
      inner: '顏 伯 駿'
    },
    meta: [
      { property: 'og:title', content: '顏 伯 駿｜讓我搭一班會爆炸的電車' },
      { property: 'og:image', content: 'assets/images/yan.jpg' },
      { property: 'og:url', content: location.href },
      { itemprop: "image", cpntent: "assets/images/yan.jpg" }
    ],
  },
  created() {
  },
  computed: {},
  methods: {
    touterPre() {
      this.$router.push('/');
    }
  },
  mounted() { },
  destroyed() { },
  components: {
    ShareBar
  }
}
</script>